AcGiIBLBackgroundTraits.secondaryBackground
Gets the background to display when DisplayImage is set to false
Returns:
Background db Id

AcGiIBLBackgroundTraits.setSecondaryBackground(AcDbObjectId!System.Runtime.CompilerServices.IsConst)
Sets the background to display when DisplayImage is set to false
Limited to 2D backgrounds only - Solid, Gradient, Image
bg:
Background db Id

AcGiIBLBackgroundTraits.displayImage
Gets whether to display the IBL image as the background
Returns:
True if IBL image is to be displayed as background

AcGiIBLBackgroundTraits.setDisplayImage(System.Boolean!System.Runtime.CompilerServices.IsConst)
Sets whether to display the IBL image as the background
bdisplay:
Set to true to display IBL image in background

AcGiIBLBackgroundTraits.rotation
Gets the rotation value for the IBL image
Returns:
Rotation value in degrees

AcGiIBLBackgroundTraits.setRotation(System.Double!System.Runtime.CompilerServices.IsConst)
Sets the rotation value for the IBL image
-180 to 180 degrees
rotation:
Rotation value in degrees (-180 to 180)

AcGiIBLBackgroundTraits.IBLImageName
Gets the image used for IBL
Returns:
Name of IBL image

AcGiIBLBackgroundTraits.setIBLImageName(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Sets the image used for IBL
name:
Name of IBL image

AcGiIBLBackgroundTraits.enable
Gets whether IBL is currently active
Returns:
True if active

AcGiIBLBackgroundTraits.setEnable(System.Boolean!System.Runtime.CompilerServices.IsConst)
Sets whether IBL is currently active
name:
True if active

AcGiIBLBackgroundTraits
This class enables IBL background definitions to be elaborated to
AcGi implementations.